app/views/produits/_form.html.erb

SELECT "famille_meds".* FROM "famille_meds" ORDER BY nom
---
    <%= f.label :famille_med_id %><br />
    <%=  f.collection_select(:famille_med_id, FamilleMed.order("nom"),:id,:nom ) %>