app/views/items/_form.html.erb

SELECT "produits".* FROM "produits" ORDER BY nom
---
    <%= f.label :produit_id %><br />
<%=  f.collection_select(:produit_id, Produit.order("nom"),:id,:nom ) %>

SELECT "tipes".* FROM "tipes" ORDER BY nom
---
    <%= f.label :tipe_id %><br />
  <%= f.collection_select(:tipe_id, Tipe.order("nom"),:id,:nom ) %>