app/controllers/famille_meds_controller.rb

SELECT "famille_meds".* FROM "famille_meds"
---
  def index
    @famille_meds = FamilleMed.all

SELECT "famille_meds".* FROM "famille_meds" WHERE ("famille_meds"."id" = 1) LIMIT 1
---
  def show
    @famille_med = FamilleMed.find(params[:id])

INSERT INTO "famille_meds" ("created_at", "nom", "updated_at") VALUES ('2011-04-07 16:45:01.135588', 'Antiinflamatoires/Analgesiques', '2011-04-07 16:45:01.135588')
---
  def create
    @famille_med = FamilleMed.new(params[:famille_med])
    if @famille_med.save