app/controllers/operations_controller.rb

  def index
    @operations = Operation.all
    @items = Item.all
---
SELECT "operations".* FROM "operations"
SELECT "items".* FROM "items"

  def show
    @operation = Operation.find(params[:id])
---
SELECT "operations".* FROM "operations" WHERE ("operations"."id" = 1) LIMIT 1

  def new
    @item = Item.find(params[:id])
---
SELECT "items".* FROM "items" WHERE ("items"."id" = 7) LIMIT 1

  def create
    @operation = Operation.new(params[:operation])
    item = Item.find(@operation.item_id)
    quantite = @operation.movement
    item.quantite += quantite
    if @operation.save and item.save
---
SELECT "items".* FROM "items" WHERE ("items"."id" = 11) LIMIT 1
INSERT INTO "operations" ("movement", "item_id", "fecha", "updated_at", "created_at") VALUES (-1, 12, '2011-04-07', '2011-04-07 22:14:15.184711', '2011-04-07 22:14:15.184711')
UPDATE "items" SET "quantite" = -4, "updated_at" = '2011-04-07 22:07:32.338550' WHERE ("items"."id" = 12)

  def edit
    @operation = Operation.find(params[:id])
---
SELECT "operations".* FROM "operations" WHERE ("operations"."id" = 1) LIMIT 1

  def update
    @operation = Operation.find(params[:id])
---
SELECT "operations".* FROM "operations" WHERE ("operations"."id" = 1) LIMIT 1

  def destroy
    @operation = Operation.find(params[:id])
    @operation.destroy
---
SELECT "operations".* FROM "operations" WHERE ("operations"."id" = 1) LIMIT 1
DELETE FROM "operations" WHERE ("operations"."id" = 1)