app/controllers/produits_controller.rb

  def index
    @produits = Produit.all
---
SELECT "produits".* FROM "produits"

  def show
    @produit = Produit.find(params[:id])
---
SELECT "produits".* FROM "produits" WHERE ("produits"."id" = 1) LIMIT 1

  def create
    @produit = Produit.new(params[:produit])
    if @produit.save
---
INSERT INTO "produits" ("famille_med_id", "nom", "created_at", "updated_at") VALUES (1, 'Acide Acétylsalicylique', '2011-04-07 16:58:28.562974', '2011-04-07 16:58:28.562974')