app/controllers/tipes_controller.rb

  def index
    @tipes = Tipe.all
---
SELECT "tipes".* FROM "tipes"

  def show
    @tipe = Tipe.find(params[:id])
---
SELECT "tipes".* FROM "tipes" WHERE ("tipes"."id" = 1) LIMIT 1

  def create
    @tipe = Tipe.new(params[:tipe])
    if @tipe.save
---
INSERT INTO "tipes" ("nom", "updated_at", "created_at") VALUES ('Comprimés', '2011-04-07 16:43:25.133421', '2011-04-07 16:43:25.133421')